test/regression_test/data/jmeter/stress_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Beer Garden Stress Test">
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="Global Garden Values">
        <collectionProp name="UserParameters.names">
          <stringProp name="-1116878166">parentGardenName</stringProp>
          <stringProp name="1258770588">childGardenName</stringProp>
          <stringProp name="1955626749">parentHostname</stringProp>
        </collectionProp>
        <collectionProp name="UserParameters.thread_values">
          <collectionProp name="-2118191308">
            <stringProp name="-995424086">parent</stringProp>
            <stringProp name="-646914181">defaultchild</stringProp>
            <stringProp name="-1752233883">beer-garden-parent</stringProp>
          </collectionProp>
        </collectionProp>
        <boolProp name="UserParameters.per_iteration">false</boolProp>
        <stringProp name="TestPlan.comments">Update here for testing outside of pipeline</stringProp>
      </UserParameters>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Beer Garden Requesters">
        <intProp name="ThreadGroup.num_threads">200</intProp>
        <intProp name="ThreadGroup.ramp_time">120</intProp>
        <longProp name="ThreadGroup.duration">1200</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <RandomController guiclass="RandomControlGui" testclass="RandomController" testname="Random Parent Request">
          <intProp name="InterleaveControl.style">1</intProp>
        </RandomController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Echo Request">
            <stringProp name="HTTPSampler.domain">${parentHostname}</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
	&quot;system&quot;: &quot;echo&quot;,&#xd;
	&quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
	&quot;namespace&quot;: &quot;${parentGardenName}&quot;,&#xd;
	&quot;command&quot;: &quot;say&quot;,&#xd;
	&quot;comment&quot;: &quot;&quot;,&#xd;
	&quot;output_type&quot;: &quot;STRING&quot;,&#xd;
	&quot;instance_name&quot;: &quot;default&quot;,&#xd;
	&quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
	&quot;parameters&quot;: {&#xd;
		&quot;message&quot;: &quot;Hello, World!&quot;,&#xd;
		&quot;loud&quot;: false&#xd;
	}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Complex Request">
            <stringProp name="HTTPSampler.domain">${parentHostname}</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;complex&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;${parentGardenName}&quot;,&#xd;
  &quot;command&quot;: &quot;echo_bool&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {&#xd;
    &quot;b&quot;: true&#xd;
  },&#xd;
  &quot;instance_name&quot;: &quot;c1&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Nested Request">
            <stringProp name="HTTPSampler.domain">${parentHostname}</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;nested-calls&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;command&quot;: &quot;level_1&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;parameters&quot;: {},&#xd;
  &quot;namespace&quot;: &quot;${parentGardenName}&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Custom Display Request">
            <stringProp name="HTTPSampler.domain">${parentHostname}</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;custom-display&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;command&quot;: &quot;echo_message_textarea&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;parameters&quot;: {&#xd;
    &quot;message&quot;: &quot;test&quot;&#xd;
  },&#xd;
  &quot;namespace&quot;: &quot;${parentGardenName}&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
        <RandomController guiclass="RandomControlGui" testclass="RandomController" testname="Random Child Request">
          <intProp name="InterleaveControl.style">1</intProp>
        </RandomController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Echo Request">
            <stringProp name="HTTPSampler.domain">${parentHostname}</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
	&quot;system&quot;: &quot;echo&quot;,&#xd;
	&quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
	&quot;namespace&quot;: &quot;${childGardenName}&quot;,&#xd;
	&quot;command&quot;: &quot;say&quot;,&#xd;
	&quot;comment&quot;: &quot;&quot;,&#xd;
	&quot;output_type&quot;: &quot;STRING&quot;,&#xd;
	&quot;instance_name&quot;: &quot;default&quot;,&#xd;
	&quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
	&quot;parameters&quot;: {&#xd;
		&quot;message&quot;: &quot;Hello, World!&quot;,&#xd;
		&quot;loud&quot;: false&#xd;
	}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Complex Request">
            <stringProp name="HTTPSampler.domain">${parentHostname}</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;complex&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;${childGardenName}&quot;,&#xd;
  &quot;command&quot;: &quot;echo_bool&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {&#xd;
    &quot;b&quot;: true&#xd;
  },&#xd;
  &quot;instance_name&quot;: &quot;c1&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Nested Request">
            <stringProp name="HTTPSampler.domain">${parentHostname}</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;nested-calls&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;command&quot;: &quot;level_1&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;parameters&quot;: {},&#xd;
  &quot;namespace&quot;: &quot;${childGardenName}&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Custom Display Request">
            <stringProp name="HTTPSampler.domain">${parentHostname}</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;custom-display&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;command&quot;: &quot;echo_message_textarea&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;parameters&quot;: {&#xd;
    &quot;message&quot;: &quot;test&quot;&#xd;
  },&#xd;
  &quot;namespace&quot;: &quot;${childGardenName}&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>